; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 363217 1 3 4 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	thermograph2 - mode
	infrared0 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star1 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Planet6 infrared1)
	(have_image Planet7 spectrograph3)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
3. (turn_to satellite0 star1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star1)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
6. (take_image satellite0 star9 instrument0 infrared0)
   added: (have_image star9 infrared0)
   goals met: 1 of 7
7. (turn_to satellite0 star11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star11)
   goals met: 1 of 7
8. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 2 of 7
9. (turn_to satellite0 planet7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet7)
   goals met: 2 of 7
10. (take_image satellite0 planet7 instrument0 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 3 of 7
11. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 7
12. (take_image satellite0 planet6 instrument0 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 4 of 7
13. (turn_to satellite0 phenomenon8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 7
14. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 7
15. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 7
16. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 7
17. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 7
